### Dependencies

In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Connect to local database that  was created using the lending_db.sql file

In [2]:
rds_connection_string = "postgres:postgres@localhost:5432/lending_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [3]:
engine.table_names()

[]

### Store transformed CSV files in Dataframes

In [4]:
lending_csv_file = "../DataFiles/clean_data_final.csv.gz"
state_csv_file = "../DataFiles/combined_state_finance_data.csv"

lending_df = pd.read_csv(lending_csv_file, compression='gzip', index_col=False)
state_df = pd.read_csv(state_csv_file)

In [5]:
lending_df.head()

,id,loan_amnt,term,int_rate,issue_date,purpose,zip_code,state,annual_inc,home_ownership
0,0,2500,36,13.56,12-2018,debt_consolidation,109xx,NY,55000,RENT
1,1,30000,60,18.94,12-2018,debt_consolidation,713xx,LA,90000,MORTGAGE
2,2,5000,36,17.97,12-2018,debt_consolidation,490xx,MI,59280,MORTGAGE
3,3,4000,36,18.94,12-2018,debt_consolidation,985xx,WA,92000,MORTGAGE
4,4,30000,60,16.14,12-2018,debt_consolidation,212xx,MD,57250,MORTGAGE

In [6]:
state_df.head()

,state,abbreviation,population,average_income_2018,average_income_2017,average_income_2016,average_vantagescore,average_credit_card_balance
0,Alabama,AL,198218,49861,48123,46257,654,5961
1,Alaska,AK,31275,74346,73181,76440,668,8516
2,Arizona,AZ,1660272,59246,56581,53558,669,6389
3,Arkansas,AR,193524,47062,45869,44334,657,5660
4,California,CA,508529,75277,71805,67739,680,6481

### Use pandas to load CSV converted DataFrames into database

In [7]:
lending_df.to_sql(name='lending_data', con=engine, if_exists='append', index=False)

In [8]:
state_df.to_sql(name='state_data', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the lending_data table

In [9]:
pd.read_sql_query('select * from lending_data', con=engine).head()

,id,loan_amnt,term,int_rate,issue_date,purpose,zip_code,state,annual_inc,home_ownership
0,0,2500,36,13.56,12-2018,debt_consolidation,109xx,NY,55000,RENT
1,1,30000,60,18.94,12-2018,debt_consolidation,713xx,LA,90000,MORTGAGE
2,2,5000,36,17.97,12-2018,debt_consolidation,490xx,MI,59280,MORTGAGE
3,3,4000,36,18.94,12-2018,debt_consolidation,985xx,WA,92000,MORTGAGE
4,4,30000,60,16.14,12-2018,debt_consolidation,212xx,MD,57250,MORTGAGE

### Confirm data has been added by querying the state_data table

In [10]:
pd.read_sql_query('select * from state_data', con=engine).head()

,state,abbreviation,population,average_income_2018,average_income_2017,average_income_2016,average_vantagescore,average_credit_card_balance
0,Alabama,AL,198218,49861,48123,46257,654,5961
1,Alaska,AK,31275,74346,73181,76440,668,8516
2,Arizona,AZ,1660272,59246,56581,53558,669,6389
3,Arkansas,AR,193524,47062,45869,44334,657,5660
4,California,CA,508529,75277,71805,67739,680,6481